МедПреды_sql/src/Documents/Визит/Визит.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Визит</name>
  <registerRecords>AccumulationRegister.ДанныеВизитовДляОтчета</registerRecords>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.ПрофилиМобильногоПриложения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВизита</name>
    <type>
      <types>EnumRef.ВидыВизитов</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеВизита</name>
    <type>
      <types>EnumRef.СостоянияВизитов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияВрача</name>
    <type>
      <types>CatalogRef.КатегорииВрачей</types>
    </type>
  </attributes>
  <attributes>
    <name>ГеоМеткаНачало</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачало</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ГеоМеткаОкончание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончание</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиротаСупервайзер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>11</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолготаСупервайзер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>11</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЧекЛист</name>
    <attributes>
      <name>Пункт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Препараты</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Матрица</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Наличие</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Цены</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

МедПреды_sql/src/Enums/ФильтрыПоВизиту/ФильтрыПоВизиту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФильтрыПоВизиту</name>
  <enumValues>
    <name>Открытые</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполненные</name>
  </enumValues>
</mdclass:Enum>

МедПреды_sql/src/Enums/СостоянияВизитов/СостоянияВизитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияВизитов</name>
  <enumValues>
    <name>Открыт</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

МедПреды_sql/src/Documents/Визит/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура УстановитьФильтр(ВидОтбораДляУстановки)
	
	ВидОтбора = ВидОтбораДляУстановки;
	
	Список.Отбор.Элементы[ИндексОтбораВРаботе].Использование = Ложь;
	Список.Отбор.Элементы[ИндексОтбораВыполненные].Использование = Ложь;
	Список.Отбор.Элементы[ИндексОтбораОткрытые].Использование = Ложь;
	Список.Отбор.Элементы[ИндексОтбораПометкаУдаления].Использование = Ложь;
	
	Если ВидОтбора = Перечисления.ФильтрыПоВизиту.ВРаботе Тогда
		Список.Отбор.Элементы[ИндексОтбораВРаботе].Использование = Истина;
		Список.Отбор.Элементы[ИндексОтбораВРаботе].ПравоеЗначение = Перечисления.СостоянияВизитов.ВРаботе;
		Список.Отбор.Элементы[ИндексОтбораПометкаУдаления].Использование = Истина;
	ИначеЕсли ВидОтбора = Перечисления.ФильтрыПоВизиту.Открытые Тогда
		Список.Отбор.Элементы[ИндексОтбораОткрытые].Использование = Истина;
		Список.Отбор.Элементы[ИндексОтбораОткрытые].ПравоеЗначение = Ложь;
		Список.Отбор.Элементы[ИндексОтбораПометкаУдаления].Использование = Истина;
	ИначеЕсли ВидОтбора = Перечисления.ФильтрыПоВизиту.Выполненные Тогда
		Список.Отбор.Элементы[ИндексОтбораВыполненные].Использование = Истина;
		Список.Отбор.Элементы[ИндексОтбораВыполненные].ПравоеЗначение = Перечисления.СостоянияВизитов.Выполнен;
		Список.Отбор.Элементы[ИндексОтбораПометкаУдаления].Использование = Истина;
	КонецЕсли;
	
	УстановитьЗаголовокФормы();
	Элементы.ФормаОтменитьФильтр.Доступность = ЗначениеЗаполнено(ВидОтбора);
	СохранитьНастройкиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиНаСервере()
	
	Константы.ФильтрПоВизиту.Установить(ВидОтбора);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокФормы()
	
	Если ЗначениеЗаполнено(ВидОтбора) Тогда
		Заголовок = НСтр("ru='Визиты (';en='Visits ('") + ВидОтбора + ")";
	Иначе
		Заголовок = НСтр("ru='Визиты';en='Visits'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Незавершенные(Команда)
	
	УстановитьФильтр(ПредопределенноеЗначение("Перечисление.ФильтрыПоВизиту.ВРаботе"));
	
КонецПроцедуры

&НаКлиенте
Процедура Открытые(Команда)
	
	УстановитьФильтр(ПредопределенноеЗначение("Перечисление.ФильтрыПоВизиту.Открытые"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьФильтр(Команда)
	
	УстановитьФильтр("");
	
КонецПроцедуры

&НаКлиенте
Процедура Выполненные(Команда)
	
	УстановитьФильтр(ПредопределенноеЗначение("Перечисление.ФильтрыПоВизиту.Выполненные"));
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидОтбора = Константы.ФильтрПоВизиту.Получить();
	
	// Предустановка отборов на список.
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("СостояниеВизита");
	ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	ИндексОтбораВРаботе = Список.Отбор.Элементы.Индекс(ЭлементОтбора);
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Отгружен");
	ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	ИндексОтбораОткрытые = Список.Отбор.Элементы.Индекс(ЭлементОтбора);
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Оплачен");
	ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	ИндексОтбораВыполненные = Список.Отбор.Элементы.Индекс(ЭлементОтбора);
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение   = Ложь;
	ИндексОтбораПометкаУдаления = Список.Отбор.Элементы.Индекс(ЭлементОтбора);
	
	//Список.Параметры.УстановитьЗначениеПараметра("СимволНомера", НСтр("ru='№ ';en='# '"));
	УстановитьФильтр(ВидОтбора);
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаЗапросаОбновления()
	
	//ОбменМобильноеПриложениеФоновыеЗадания.ВыполнениеОбменаПриОбновленииСписка();
	Оповестить("ПрошелОбмен");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПрошелОбмен"
		ИЛИ ИмяСобытия = "ДействиеСКорзиной"
		ИЛИ ИмяСобытия = "ЗаписанЗаказ" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Справка(Команда)
	
	ПерейтиПоНавигационнойСсылке("http://server.prof-it.ru/redmine/projects/dfgwiki/wiki/Wiki");
	
КонецПроцедуры
